export default {
    name: "calc",
    cards: [
        ["如何判断拐点", "f''(c)=0, 两侧变号 \\\\ 或f''(c)=0, f'''(c)\\ne0"],
        ["极限为指数时使用洛必达", "若f(x)=g(x)^{m(x)}, 可将其改写为\\ln形式 \\\\ f(x)=e^{m(x)\\ln[g(x)]}, 这样就化为了乘法 \\\\ 可以尝试把一个因子放到分母上 \\\\ f(x)=e^{\\frac{\\ln[g(x)]}{\\frac{1}{m(x)}}}, 就可以尝试用洛必达了"],

        ["洛必达法则的适用情况", "\\frac{0}{0}, \\frac{\\infty}{\\infty}, 若不是这个形式 \\\\ 可以尝试通分, 取对数, 等方式转化"],
        ["牛顿法近似 \\\\ a是f(x)=0的一个近似", "b=a-\\frac{f(a)}{f'(a)}"],
        ["f在x=a处的微分", "df=f'(a)\\triangle x"],
        ["f(a+\\triangle x)\\approx", "f(a)+f'(a)\\triangle x"],
        ["线性化方程L(x)", "L(x)=f(a)+f'(a)(x-a)"],
        ["0 * \\infty时使用洛必达", "化成\\frac{\\infty}{\\frac{1}{0}}的形式, 即  (\\frac{\\infty}{\\infty})"],
        ["\\infty - \\infty时使用洛必达", "想办法通分成\\frac{0}{0}或\\frac{\\infty}{\\infty}的形式"],
        ["f''(x)的正负代表什么？", "f''(x)>0代表函数凹向上 \\\\ f''(x)<0代表函数凹向下"],
        ["二阶导如何判断f'(a)=0的类型", "f''(a)>0=局部最小值 \\\\ f''(a)<0=局部最大值 \\\\ f''(a)=0 无法判断 "],
        ["一阶导如何判断f'(a)=0的类型", "从左往右通过a点: \\\\ f'(x)从负到正=局部最小值 \\\\ f'(x)从正到负=局部最大值 \\\\ f'(x)符号不变=拐点 "],
        ["f'(a)=0代表什么？", "text:a点可能是f(x)的局部最大值、局部最小值，或拐点"],
        ["f''(c)=0 意味着拐点吗?", "c不一定是拐点"],
        ["零点定理", "若f(x)在[a,b]上连续，f(a)与f(b)异号 \\\\ 即f(a)f(b)<0, 那在(a,b)之间必有一点c \\\\ 使得f(c)=0"],
        ["连续的定义？", "\\lim_{x \\to a}{f(x)}=f(a) \\\\ f在点a处连续 "],
        ["极值定理", "image:math_extreme_value_theorem.png"],
        ["罗尔定理", "image:math_rolles_theorem.png"],
        ["中值定理", "image:math_mean_value_theorem.png"],
    ]
}
