export default {
    name: "thought",
    cards: [
        ["证明f(x)=x\\sin(x)是无界函数","由于f(2n\\pi+\\frac{\\pi}{2})=2n\\pi+\\frac{\\pi}{2} \\\\ 所以对任意的M>0，只要正整数n充分大 \\\\ 总有 |f(2n\\pi+\\frac{\\pi}{2})|=2n\\pi+\\frac{\\pi}{2}>M \\\\ 故f(x)=x\\sin(x)是无界函数"],
        ["\\int \\frac{1}{(x^2+4)^2}dx 思路","x=2\\tan\\theta \\\\ 不是只在根号下才能用三角函数替换 \\\\ 打开思路"],
        ["\\sum_{n=m}^{\\infty}ar^n的收敛发散情况?","若r \\in (-1, 1), 级数收敛于\\frac{首项}{1-r} \\\\ 若 r \\in [1,+\\infty) 或 r \\in (-\\infty,-1], 级数发散"],
        ["\\int \\ln(x)dx \\\\ 解题思路?", "\\ln(x)的积分不是\\frac{1}{x} \\\\ 这个积分要分部积分来算"],
        ["\\int \\frac{1}{\\sqrt{x-x^2}}dx \\\\ 解题思路?", "把x提出来，剩下\\sqrt{1-x} \\\\ 可以看作\\sqrt{1-\\sqrt{x}^2} \\\\ 重点是x可以看做\\sqrt{x}^2 \\\\ 变成熟悉的常见导数"],
        ["\\int e^{2x}\\cos(x)dx \\\\ 解题思路?", "类似\\sin,\\cos,e^x等  \\\\ 求导两次会变回自身的 \\\\ 多次分部积分 \\\\ 移动到等式左边解出原式"],
        ["\\int \\cos(\\sqrt{x})dx 思路", "u=\\sqrt{x} \\\\ u^2 = x \\\\ 2udu=dx \\\\ 换元两边求导，x也要有dx "],
        ["\\int \\frac{1}{x^2\\sqrt{x^2+1}} 思路", "变成\\int \\frac{x^{-3}}{\\sqrt{1+x^{-2}}} \\\\ 分数尽量写成负次幂 \\\\ 多考虑负次幂换元的可能"],
        ["\\int \\csc^3(x)\\sec(x)", "1可以看做\\sin^2 + \\cos^2"],
        ["\\int \\frac{x^2+1}{x^4-x^2+1}", "因式分解不了的,就配方 \\\\ 每次变动后检查能否换元 \\\\ 尝试配成常见的导数"],
        ["\\int \\frac{\\cos(2x)}{\\sin(x)+\\cos(x)}", "\\cos(2x)变成平方差\\cos^2(x)-\\sin^2(x)"],
        ["求\\int \\sec(x)的思路", "\\sec(x) * \\frac{\\sec(x)+\\tan(x)}{\\sec(x)+\\tan(x)} \\\\ 构造\\frac{f'(x)}{f(x)}"],
    ],
}