export default {
    name: "differential_equation",
    cards: [
        //["", ""],
        ["image:math_2023-08-22-15-10-54.png", "image:math_2023-08-22-15-11-12.png", "快速写欧拉方程的特征方程", "D(D-1)y+4Dy+2y=0 \\\\ 把D换成r,去掉y即可 \\\\ r(r-1)+4r+2=0 \\\\ r^2+3r+2=0"],
        ["什么是欧拉方程", "image:math_2023-09-09-15-55-33.png", "如何求通解?", "令x=e^t \\\\ x^ky^{\\left(k\\right)}=D\\left(D-1\\right)\\dots \\left(D-K+1\\right)y \\\\ 其中D=\\frac{d}{dt},Dy=\\frac{dy}{dt} \\\\ D^2=\\frac{d^2}{dt^2},D^2y=\\frac{d^2y}{dt^2}", "(D-k+1)就是写到-k+1停 \\\\ 比如k=2, -k+1就是-1 \\\\ 写到D-1就停: D(D-1) \\\\ 比如k=1, -k+1=0, 写到D就停"],
        ["常系数非齐次线性微分方程", "y''+py'+qy=f(x)", "f(x)=e^{\\lambda x}P_m(x)求通解 \\\\ 指数乘多项式形式",
            "指数乘多项式的特解: \\\\ y^*=x^kQ_m(x)e^{\\lambda x} \\\\ 代入原方程确定系数", "image:math_2023-08-22-14-40-23.png",
            "指数乘三角", "image:math_2023-08-22-14-43-32.png",
            "image:math_2023-08-22-14-45-33.png"
        ],
        ["常系数线性微分方程", "y''+py'=qy=0 \\\\ 特征方程:r^2+pr+q=0 \\\\ 假设r_1,r_2是方程的两个根",
            "若r_1\\ne r_2,通解为?",
            "通解为y=C_1e^{r_1x}+C_2e^{r_2x}",
            "若r_1=r_2=r,通解为?",
            "通解为y=e^{rx}(C_1+C_2x)",
            "若r_{1,2}为共轭复根 \\\\ r_{1,2}=\\alpha\\pm i\\beta \\\\ 通解为?",
            "image:math_2023-08-22-13-20-51.png"
        ],
        ["高阶线性微分方程", "二阶线性齐次方程: \\\\ y''+p(x)y'+q(x)y=0 \\\\ 最高阶数为二阶 \\\\ y'', y', y有相同次数 \\\\ 若y_1(x)和y_2(x)是该齐次方程的两个线性无关的特解 \\\\ 那么y=C_1y_1(x)+C_2y_2(x)是齐次方程的通解",
            "齐次方程: \\ y''+p(x)y'+q(x)y=0 \\ \\ 记作(1) \\\\ 非齐次方程: \\ y''+p(x)y'+q(x)y=f(x) \\ \\ 记作(2) \\\\ 若y^*是非齐次议程(2)的特解 \\\\ y_1(x)和y_2(x)是齐次方程(1)的两个线性无关的特解: \\\\ 那么y=C_1y_1(x)+C_2y_2(x)+y^*(x)是(2)的通解",
            "若y_1^*(x),y_2^*(x)是非齐次方程(2)的两个特解,则?",
            "y(x)=y_2^*(x)-y_1^*(x)是齐次方程(1)的一个解",
            "image:math_2023-08-22-13-11-48.png", "image:math_2023-08-22-13-12-08.png",
            "如何判断两个函数线性无关?", "\\frac{y_1(x)}{y_2(x)}\\not\\equiv C \\\\ 比值不恒等于常数,则线性无关 \\\\ 若恒等于常数,则线性相关"

        ],
        ["可降阶方程", "(1) \\ y''=f(x)", "直接求积分即可，每积一次降一次阶",
            "(2) \\ y''=f(x,y')",
            "令P=y', y''=\\frac{dP}{dx} \\\\ 原式=>\\frac{dP}{dx}=f(x,P) \\\\ 这就化成了一阶方程",
            "(3) \\ y''=f(y,y')",
            "令P=y', y''=\\frac{dP}{dy}\\frac{dy}{dx}=\\frac{dP}{dy}P \\\\ 原式=>\\frac{dP}{dy}P=f(y,P) \\\\ 这就化成了一阶方程",
        ],
        ["伯努利方程", "y'+P\\left(x\\right)y=Q\\left(x\\right)y^a,\\left(a\\ne 1\\right)", "把y^a除过去,式子会出现y^{1-a} \\\\ 再用u=y^{1-a}作变量代换"],
        ["线性方程", "y'+P(x)y=Q(x)", "线性方程通解: \\\\ y=e^{-\\int p\\left(x\\right)dx}\\left[\\int Q\\left(x\\right)e^{\\int p\\left(x\\right)dx}dx+C\\right] \\\\ 写成标准形式，代入通解公式 \\\\ p(x)的积分和q(x)的积分不用加常数 \\\\ p(x)的积分如果出现了\\frac{1}{x}不需要加绝对值"],
        ["齐次方程", "\\frac{dy}{dx}=\\phi(\\frac{y}{x})", "令\\frac{y}{x}=u , y=xu \\\\ \\frac{dy}{dx}=u+x\\frac{du}{dx} \\\\ u+x\\frac{du}{dx}=\\phi(u) \\\\ 这就是一个可分离变量的方程"],
        ["可分离变量的微分方程", "y'=f(x)g(y) \\\\ \\frac{dy}{dx}=f(x)g(y) \\\\ \\frac{dy}{g(y)}=f(x)dx", "可分离变量的方程如何求解", "分离变量后，两边同时不定积分" ],
        ["什么是微分方程", "含有未知函数导数的方程,如: \\\\ y'=y+x \\\\ y''+y^3=x \\\\ y''=e^x",
            "微分方程的阶", "微分方程中导数的最高阶数",
            "微分方程的解", "把函数代到微分方程中，如果能满足这个式子 \\\\ 该函数就是微分方程的解",
            "微分方程的通解", "解里要存在任意常数 \\\\ 且独立的任意常数的个数要与方程的阶相同 \\\\ 例如:y''=e^x \\\\ 通解:y=e^x+c_1x+c_2 \\\\ 独立指不能合在一起",
            "微分方程的特解", "不含有任意常数的解,如:y''=e^x \\\\ y=e^x 就是一个特解 \\\\ 特解其实就是通解定任意常数 \\\\ 定常数往往需要条件",
            "初始条件", "定特解的条件 \\\\ 也称:定解条件",
            "积分曲线", "一个微分方程的解就对应一条曲线  \\\\ 该曲线就是原方程的一条积分曲线"
        ],
    ]
}

