export default {
    name: "new",
    cards: [
        // [``, ``],
        [`物质与时空的关系`, `不可分割\n时间和空间是运动着的物质的基本存在形式`],
        [`运动和静止的关系`, `对立统一：相互区别，也相互联系`,
            `运动和静止的相互区别：\n 运动的绝对性体现了物质运动的变动性、无条件性。\n 静止的相对性体现了物质运动的稳定性、有条件性。`,
            `运动和静止的相互联系：\n 动中有静，静中有动`
        ],
        [`物质与运动的关系` ,`不可分割,运动是物质存在的方式和根本属性 \n 运动是物质的运动、物质是运动的物质 \n 否定前半句就是唯心主义，否定后半句就是形而上学`],
        [`"物质的范畴及其意义" \n 这句话是在问什么?`, "这其实就是在问物质是什么", "恩格斯对物质的定义?", `物、物质无非是各种物的总和，而这一概念就是从这一总和中抽象出来的 \n 共性和个性的关系 \n 普遍和特殊的关系 \n 具体和抽象的关系`,
            `列宁对物质的定义?`, `"...物质不依赖我们的感觉而存在..." \n 物质的共同特性是客观实在性`
        ],

        ["为什么说古典唯物和机械唯物是半截子唯物主义?", "他们在自然观上唯物，在历史观上唯心"],
        ["哲学的重要问题", "世界是怎样存在的? \n 哲学上有哪两派问答?", "1.辩证法:世界是联系的、全面的、发展的、有矛盾的 \n 2.形而上学:世界是孤立的、片面的、静止的、无矛盾的"],
        ["二元论者是唯物还是唯心?", "是不彻底的唯心"],
        ["哲学基本问题", "哲学的基本问题包含两方面 \n 1. 物质和意识何者为第一性 \n 2. 物质和意识是否具有同一性", "第一性的问答", "认为物质是世界本原的，就称为唯物主义 \n 认先意识是世界本原的，称为唯心主义",
            "唯物主义分为哪几类?", "朴素(古典)唯物主义:物质是一种或几种实物 \n 机械唯物主义:构成物质的最小粒子 \n 辩证唯物主义:一切客观存在(历史)",
            "什么是唯物史观?", "把历史当作物质去看待 \n 得出的观点、理论就是唯物史观", "马克思在哲学史上的两大历史贡献?", "1.创立了唯物史观 \n 2.形成了辩证唯物主义",
            "唯心主义分几类?", "1.吾心即世界(主观唯心主义) \n 2.独立于人之外的精神(客观唯心主义)[上帝说、道生万物]",

            "同一性的回答", "我们的意识能否认识外部世界的物质 \n 认为有同一性的，称作可知论(唯物、唯心) \n 认为没有同一性的，称作不可知论(二元论) "
        ],
        ["马克思主义的构成（三个部分）", "马克思主义哲学 \n 马克思主义政治经济学 \n 科学社会主义",
            "它的主体部分是什么?", "政治经济学,(资本论) \n 哲学是基础和方法 \n 科社是目的和归宿"
        ],
    ]
}
