export default {
    name: "cultural",
    cards: [
        // ["", ""],
        ["《自然辩证法》", "第一次系统阐述马克思主义自然观和科学观"],
        ["《法兰西内战》", "科学总结巴黎公社的历史经验和教训"],
        ["《哥达纲领批判》", "提出共产主义分为两个阶段：社会主义社会、共产主义社会；进一步丰富了科学社会主义"],
        ["《家庭、私有制和国家起源》", "马恩的国家学说"],
        ["《关于费尔巴哈的提纲》", `“天才萌芽”、“科学实践观”`],
        ["《帝国主义是资本主义的最高阶段》", "指出帝国主义是无产阶级革命的前夜"],
        ["《论欧洲联邦口号》", "一国胜利论", `首次明确提出“一国胜利论”列宁认为无产阶级革命可能在少数国家甚至在一国取得胜利`],
        ["《国家与革命》", "发展了马克思主义的国家革命论，马克思主义国家学说的代表作之一"],
        ["《唯物主义和经验批判主义》", "明确提出“生活”、“实践”的观点、应该是认识论的首要的基本的观点"],

        ["哲学的贫困", "马克思主义学说最早发表的文本"],
        ["神圣家族", "批判黑格尔的主观唯心主义，是马恩第一次合著的作品"],
        ["德法年鉴", "实现了'两个转变',奠定思想前提", "实现了唯心主义转唯物主义、革命民主主义转向共产主义\n为创立马克思主义奠定了思想前提"],
        ["反杜林论", "全面阐述马克思主义理论体系、三个组成部份进行全面阐述", "全面阐述马克思主义理论体系的著作"],
        ["共产党宣言", "科社、马克思主义的诞生\n第一个无产阶级政党的党纲", "1.标志着科学社会主义的诞生\n2.标志着马克思主义的诞生\n3.世界上第一个无产阶级政党的党纲"],
        ["德意志形态", "首次系统阐述历史唯物主义", "首次系统阐述历史唯物主义基本观点，创立唯物史观、标志着马克思主义哲学的诞生"],
        ["资本论", "政经的诞生，被誉为'工人阶级的圣经'", "系统阐述剩余价值理论，标志马克思主义政治经济学的诞生"],
    ]
}
