export default {
    name: "new",
    cards: [
        // ["", ""],
        ["运算式的三种表达方式", "中缀表达式: a+b \n 后缀表达式(逆波兰式): ab+ \n 前缀表达式(波兰式): +ab", "中缀转后缀: 左优先",
            "中缀转前缀: 右优先",
            "逆波兰运算", "操作数push进栈 \n 遇到运算符弹出两个操作数 \n 第二个pop为左操作数 \n 例7-3, [7,3]-",
            "波兰运算", "从右往左遍历, 操作数push进栈 \n 遇到运算符弹出两个操作数 \n 第1个pop为左操作数 \n 例7-3, -73",
        ],
        ["栈中输入4个元素，存在几种合法出栈序列?", "卡特兰数:$\\frac{1}{n+1}C^n_{2n}$ \n 假设栈中有4个元素 \n 就存在$\\frac{1}{4+1}C^4_{8}=14$个合法出栈序列"],
        ["计算队列元素的个数", "(rear+maxSize-front)%maxSize"],
        ["image:algo_2023-08-16-05-31-38.png", "其中SLinkList代表什么", "image:algo_2023-08-16-05-33-02.png"],
        ["C实现链表的注意事项?", "一定要用malloc \n node->next一定要初始化为NULL"],
        ["下标和位序的区别?", "下标从0开始,位序从1开始 \n 下标=位序-1"],
        ["算法原地工作(in-place algo)是什么?", "指空间复杂度为常数的算法"],
    ]
}
